# 1.2 Как проходить курс

# Теоретические конспекты

# В конспекте всегда достаточно информации, чтобы решить следующие за ним тестовые задачи и задачи на программирование.
# Некоторые конспекты содержат секцию примечания, где можно узнать дополнительные данные или интересные факты.

# Также обращайте внимание на сноски, отмеченные как важные. В этом курсе важные сноски помечены с помощью Emoji.
# Например, так:

# Важно помнить: приоритет оператора not выше, чем у оператора and, приоритет которого, в свою очередь,
# выше, чем у оператора or.

# Если не получается решить тестовую задачу или задачу на программирование, имеет смысл вернуться к конспекту и еще раз
# внимательно его прочесть 🙂

# Тестовые задачи

# Могут быть в виде:
# тестов с единственным верным вариантом ответа;
# тестов с несколькими верными ответами;
# численных задач (ответ - число);
# текстовых задач (ответ - строка текста);
# задач на сопоставление;
# задач на сортировку;
# задач с использованием таблиц.

# 