# 1.2 Как проходить курс?

# Структура курса
# "Поколение Python: курс для начинающих" состоит из:
#
# Теоретических конспектов
# Тестовых задач
# Задач на программирование

# Теоретические конспекты
# Теоретические конспекты содержат информацию по теме урока. Информации в конспекте всегда достаточно, чтобы решить следующие за ним тестовые задачи и задачи на программирование. Некоторые конспекты содержат секцию примечания с дополнительными сведениями или интересными фактами.
#
#
#
# Обращайте внимание на сноски, отмеченные как важные.
#
#
#
# Если не получается решить тестовую задачу или задачу на программирование, имеет смысл вернуться к конспекту и еще раз внимательно его прочитать.

# Тестовые задачи
# Могут быть в виде:
#
# 1) тестов с единственным верным вариантом ответа;
#
#
#
# 2) тестов с несколькими верными ответами;
#
#
#
# 3) численных задач (ответ - число);
#
#
#
# 4) текстовых задач (ответ - строка текста);
#
#
#
# 5) задач на сопоставление;
#
#
#
# 6) задач на сортировку;
#
#
#
# 7) задач с использованием таблиц.

# Задачи на программирование
# Задачи на программирование делятся на три категории:
#
# базовая  —
# 5
# 5 баллов;
# повышенного уровня сложности помечена перчиком 🌶️ и оценивается в
# 10
# 10 баллов;
# высокого уровня сложности помечена двумя перчиками 🌶️🌶️ и оценивается в
# 20
# 20 баллов.
# После трех попыток решения задачи повышенного и высокого уровня сложности открывается доступ на форум, где задачу обсуждают решившие ее. Для каждой такой задачи есть закрепленное авторами курса образцовое решение.
#
#    Чтобы открылся следующий модуль в курсе нужно набрать не менее
# 30
# %
# 30% баллов в предыдущем.
#
# Как проверяются задачи на программирование?
# Задачи на программирование проверяются автоматически. Вашей программе подаются на вход данные, а проверяется результат ее работы. У каждой задачи на программирование имеется секция input/output, где указаны некоторые входные и ожидаемые выходные данные.
#
#
#
# Важно понимать, что на странице задачи вы видите лишь часть тестов, которые позволяют лучше понять принцип работы программы.
# Полный набор тестов спрятан в выпадающий блок. Он обычно всегда находится под условием задачи.
#
#
#
#
#
# При нажатии мы видим полный список тестов, на которых тестируется программа.
#
#
#
#
#
# Вот пример такого блока тестов - он должен стать вашим главным другом и наставником =)
#
# Тестовые данные 🟢
# Рекомендуем заглядывать в этот блок, если после первых попыток решения ваша программа не проходит проверку и вы не можете разобраться в причинах.
#
#  Не следует зашивать тестовые данные в свои программы. Нужно писать программу так, чтобы она работала одинаково правильно на любых входных данных.
#
# Что делать, если задача решена неверно?
# Если ваша программа работает неверно на одном из тестов, отображенных в секции input/output задачи, то вы получите подробную информацию относительно ошибки. В частности, можно увидеть входные данные, ожидаемые выходные данные, а также данные возвращенные программой и не совпадающие с ожидаемыми.
#
# Для исправления ошибки, мы настоятельно рекомендуем еще раз прочитать код программы и условие задачи. Также стоит сравнить тестовые данные, которые у вас не проходят.
#
# Рекомендуется внимательно проследить, где в вашем коде возникает ошибка. Для этого рекомендуется пошагово просмотреть все линии кода и понаблюдать за изменением переменных. Также стоит обратить внимание на то, какие условия выполяются, в какой блок кода переход происходит. Только самостоятельная работа и поиск ошибок смогут сделать из вас настоящего программиста. Конечно, в любой момент вы можете попросить помощи у преподавателей или других студентов курса. Однако рекомендуется самому попытаться разобраться и проверить свою программу на всех тестах.
#
#
#
# Тестирование своей программы
# На платформе Stepik есть встроенная возможность тестирования своей программы. Для того, чтобы протестировать свою программу нужно нажать на черную кнопку Запустить код.
#
#
#
# По умолчанию при тестировании программы подставляется значение из первого теста в задаче. Однако вы можете изменять входные данные и смотреть как меняется результат работы программы.
#
#
#
# Мы настоятельно рекомендуем тестировать свои программы перед тем, как отправлять их на проверку.
#
# Примечание. В условиях некоторых задач даются формулы, которые нужно использовать в программах. Рекомендуем набирать эти формулы вручную, а не копировать из условия. Из-за того, что Python видит разницу между символами -, − и —, наши типографически красивые формулы не работают как код.

# Часто задаваемые вопросы
# 1) Задача решена верно, но не начислены баллы, а также не открывается форум решений
#
#
# В данном случае это проблема Stepik. Баллы начисляются после перезагрузки страницы. Не переживайте, если у вас такое случается, не надо писать гневные комментарии авторам =). Просто перезагрузите страницу.
#
#
#
# 2) Не успел (а) решить итоговую работу вовремя, либо произошло ЧП (отключили электричество, пропал интернет и т.д.)
# В таком случае напишите в службу поддержки Stepik support@stepik.org. Попросите их сбросить вам экзамен.
#
#
#
# 3) После решения всех задач итоговой работы продолжает тикать время. Как его остановить
#
#
# Никак, таймер выключается по истечении всего данного времени. Вручную его не отключить. Всё из-за того, что вы умудрились решить итоговую работу слишком быстро. Никто не рассчитывал на это =)




